blog/12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-14 Tue 23:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP. 2.1.3</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP. 2.1.3
<br />
<span class="subtitle">2023-03-14 Tue</span>
</h1>

<div id="outline-container-org08e13ba" class="outline-2">
<h2 id="org08e13ba">2.1.3 What Is Meant by Data?</h2>
<div class="outline-text-2" id="text-org08e13ba">
<p>
The operations <code>add-rat</code>, <code>sub-rat</code> are defined in terms of the
unspecified procedures <code>make-rat</code>, <code>numer</code>, <code>denom</code>, but we can think
of them as defined in terms of ``data objects'': rational numbers,
numerators, and denominators, the behavior of which is specified by
those unspecified procedures.
</p>

<p>
Now, what is <i>data</i>?
</p>

<blockquote>
<p>
In general, we can think of data as defined by some collection of
selectors and constructors, together with specified conditions that
these procedures must fulfill in order to be a valid representation.
</p>
</blockquote>

<p>
What does that mean? Two examples are given.
</p>

<p>
The first one is, again, in connection with our rational numbers
system: <code>make-rat</code>, <code>numer</code>, and <code>denom</code> must satisfy the condition
and <i>only</i> the condition that, for any integer n and any non-zero
integer \(d\), if \(x\) is <code>(make-rat n d)</code>, then \(\frac{(numer ~
x)}{(denom ~ x)} = \frac{n}{d}\)
</p>

<p>
The second example is in connection with the notion of <i>pair</i>: <code>cons</code>,
<code>car</code>, and <code>cdr</code> must satisfy the condition and <i>only</i> the condition
that, for any objects <code>x</code> and <code>y</code>, if <code>z</code> is <code>(cons x y)</code> then <code>(car
z)</code> is <code>x</code> and <code>(cdr z)</code> is <code>y</code>.
</p>

<p>
The authors are quite excited to present an implementation of <code>cons</code>,
<code>car</code>, and <code>cdr</code> that uses no data structure and only procedures.
</p>
</div>
</div>

<div id="outline-container-org3733483" class="outline-2">
<h2 id="org3733483">Exercise 2.4</h2>
<div class="outline-text-2" id="text-org3733483">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Here is an alternative procedural representation of pairs. For this
representation, verify that (car (cons x y)) yields x for any objects
x and y.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b6a0ff;">define</span> (<span style="color: #feacd0;">cons</span> x y)
  (<span style="color: #b6a0ff;">lambda</span> (m) (m x y)))

(<span style="color: #b6a0ff;">define</span> (<span style="color: #feacd0;">car</span> z)
  (z (<span style="color: #b6a0ff;">lambda</span> (p q) p)))
</pre>
</div>

<p>
What is the corresponding definition of cdr? (Hint: To verify that
this works, make use of the substitution model of 1.1.5.)
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
<code>(car (cons x y))</code> is the application <code>car</code> to the result of the
application of <code>cons</code> to <code>x</code> and <code>y</code>.
</p>

<p>
The application of <code>cons</code> to <code>x</code> and <code>y</code> is <code>(lambda (m) (m x y))</code>.
</p>

<p>
So, the application of car to the application of <code>cons</code> to <code>x</code> and <code>y</code>
is <code>(car (lambda (m) (m x y)))</code>.
</p>

<p>
We can now take the body of <code>car</code> and replace each istance of <code>z</code> with
<code>(car (lambda (m) (m x y)))</code>. This gives us:
</p>

<div class="org-src-container">
<pre class="src src-scheme">((<span style="color: #b6a0ff;">lambda</span> (m) (m x y)) (<span style="color: #b6a0ff;">lambda</span> (p q) p))
</pre>
</div>

<p>
This latter combination is the application of <code>(lambda (m) (m x y))</code>
to <code>(lambda (p q) p)</code>.
</p>

<p>
We can now take the body of the first lambda (the procedure we are
applying) and replace each instance of <code>m</code> with the second lambda
(that to which we are applying the first lambda). This gives us:
</p>

<div class="org-src-container">
<pre class="src src-scheme">((<span style="color: #b6a0ff;">lambda</span> (p q) p) x y)
</pre>
</div>

<p>
This latter combination is the application of <code>(lambda (p q) p)</code> to
<code>x</code> and <code>y</code>. Which evaluates to <code>x</code>.
</p>

<p>
The corresponding definition of <code>cdr</code> is:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b6a0ff;">define</span> (<span style="color: #feacd0;">cdr</span> z)
  (z (<span style="color: #b6a0ff;">lambda</span> (p q) q)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd85aaa2" class="outline-2">
<h2 id="orgd85aaa2">Exercise 2.5</h2>
<div class="outline-text-2" id="text-orgd85aaa2">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Show that we can represent pairs of nonnegative integers using only
numbers and arithmetic operations if we represent the pair \(a\) and \(b\)
as the integer that is the product \(2^a3^b\). Give the corresponding
definitions of the procedures <code>cons</code>, <code>car</code>, and <code>cdr</code>.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
Given that the priority is torturing my brain with programming
challenges and not with maths, I've asked ChatGPT what's the way to
know the value of \(a\) and \(b\) given the product \(2^a3^b\). It said
that:
</p>
<blockquote>
<p>
To find the value of b, you can repeatedly divide the integer by 3
until it is no longer divisible by 3. The number of times you can
divide by 3 is equal to the value of b. For example, if the integer is
162, you can divide by 3 three times to get 18, and then once more to
get 2. This means that b=4.
</p>

<p>
To find the value of a, you can divide the resulting quotient from the
previous step by 2 until it is no longer divisible by 2. The number of
times you can divide by 2 is equal to the value of a. For example,
using the same integer 162, we divided it by 3 four times to get 2. We
can then divide 2 by 2 once to get 1. This means that a=1.
</p>

<p>
Therefore, for an integer that is the product of 2<sup>a</sup> and 3<sup>b</sup>, you can
find the values of a and b by dividing the integer by 3 repeatedly to
find b, and then dividing the quotient by 2 repeatedly to find a.
</p>
</blockquote>

<p>
Now that I know the relevant maths bit:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #989898;">;; </span><span style="color: #989898;">from chapter 1 ******</span>
(<span style="color: #b6a0ff;">define</span> (<span style="color: #feacd0;">square</span> x) (* x x))

(<span style="color: #b6a0ff;">define</span> (<span style="color: #feacd0;">fast-expt</span> b n)
  (<span style="color: #b6a0ff;">cond</span> ((= n 0)
         1)
        ((even? n)
         (square (fast-expt b (/ n 2))))
        (<span style="color: #b6a0ff;">else</span>
         (* b (fast-expt b (- n 1))))))

(<span style="color: #b6a0ff;">define</span> (<span style="color: #feacd0;">even?</span> n)
  (= (remainder n 2) 0))
<span style="color: #989898;">;; </span><span style="color: #989898;">*********************</span>

(<span style="color: #b6a0ff;">define</span> (<span style="color: #feacd0;">cons</span> a b)
  (* (fast-expt 2 a)
     (fast-expt 3 b)))

(<span style="color: #b6a0ff;">define</span> (<span style="color: #feacd0;">car</span> x)
  (<span style="color: #b6a0ff;">define</span> (<span style="color: #feacd0;">car-iter</span> x i)
    (<span style="color: #b6a0ff;">if</span> (not (even? x))
        i
        (car-iter (/ x 2) (+ i 1))))
  (car-iter x 0))

(<span style="color: #b6a0ff;">define</span> (<span style="color: #feacd0;">cdr</span> x)
  (<span style="color: #b6a0ff;">define</span> (<span style="color: #feacd0;">cdr-iter</span> x i)
    (<span style="color: #b6a0ff;">if</span> (not (= (remainder x 3) 0))
        i
        (cdr-iter (/ x 3) (+ i 1))))
  (cdr-iter x 0))

(<span style="color: #b6a0ff;">define</span> <span style="color: #feacd0;">my-pair</span> (cons 3 2)) <span style="color: #989898;">;; </span><span style="color: #989898;">my-pair is now 72</span>
(car my-pair) <span style="color: #989898;">;; </span><span style="color: #989898;">=&gt; 3</span>
(cdr my-pair) <span style="color: #989898;">;; </span><span style="color: #989898;">=&gt; 2</span>

(cons 7 5)
(<span style="color: #b6a0ff;">define</span> <span style="color: #feacd0;">another-pair</span> (cons 7 5)) <span style="color: #989898;">;; </span><span style="color: #989898;">another-pair is now 31104</span>
(car another-pair) <span style="color: #989898;">;; </span><span style="color: #989898;">=&gt; 7</span>
(cdr another-pair) <span style="color: #989898;">;; </span><span style="color: #989898;">=&gt; 5</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org53b9464" class="outline-2">
<h2 id="org53b9464">Exercise 2.6</h2>
<div class="outline-text-2" id="text-org53b9464">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
In case representing pairs as procedures wasn’t mind-boggling enough,
consider that, in a language that can manipulate procedures, we can
get by without numbers (at least insofar as nonnegative integers are
concerned) by implementing 0 and the operation of adding 1 as
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b6a0ff;">define</span> <span style="color: #feacd0;">zero</span> (<span style="color: #b6a0ff;">lambda</span> (f) (<span style="color: #b6a0ff;">lambda</span> (x) x)))

(<span style="color: #b6a0ff;">define</span> (<span style="color: #feacd0;">add-1</span> n)
  (<span style="color: #b6a0ff;">lambda</span> (f) (<span style="color: #b6a0ff;">lambda</span> (x) (f ((n f) x)))))
</pre>
</div>

<p>
This representation is known as <i>Church numerals</i>, after its inventor,
Alonzo Church, the logician who invented the λ-calculus.
</p>

<p>
Define one and <code>two</code> directly (not in terms of <code>zero</code> and
<code>add-1</code>). (Hint: Use substitution to evaluate <code>(add-1 zero)</code>). Give a
direct definition of the addition procedure <code>+</code> (not in terms of
repeated application of <code>add-1</code>).
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b6a0ff;">define</span> <span style="color: #feacd0;">zero</span> (<span style="color: #b6a0ff;">lambda</span> (f) (<span style="color: #b6a0ff;">lambda</span> (x) x)))

(<span style="color: #b6a0ff;">define</span> (<span style="color: #feacd0;">add-1</span> n)
  (<span style="color: #b6a0ff;">lambda</span> (f) (<span style="color: #b6a0ff;">lambda</span> (x) (f ((n f) x)))))

<span style="color: #989898;">;; </span><span style="color: #989898;">Use substitution to evaluate (add-1 zero):</span>
(add-1 zero)
(<span style="color: #b6a0ff;">lambda</span> (f)
  (<span style="color: #b6a0ff;">lambda</span> (x)
    (f
     (((<span style="color: #b6a0ff;">lambda</span> (f)
         (<span style="color: #b6a0ff;">lambda</span> (x) x))
       f)
      x))))
<span style="color: #989898;">;; </span><span style="color: #989898;">=&gt;</span>
(<span style="color: #b6a0ff;">lambda</span> (f)
  (<span style="color: #b6a0ff;">lambda</span> (x)
    (f
     ((<span style="color: #b6a0ff;">lambda</span> (x) x)
      x))))
<span style="color: #989898;">;; </span><span style="color: #989898;">=&gt; the following should be the def. of 1</span>
(<span style="color: #b6a0ff;">lambda</span> (f)
  (<span style="color: #b6a0ff;">lambda</span> (x)
    (f x)))
<span style="color: #989898;">;; </span><span style="color: #989898;">So:</span>
(<span style="color: #b6a0ff;">define</span> <span style="color: #feacd0;">one</span>
  (<span style="color: #b6a0ff;">lambda</span> (f)
    (<span style="color: #b6a0ff;">lambda</span> (x)
      (f x))))

<span style="color: #989898;">;; </span><span style="color: #989898;">Let's now try to apply add-1 to what we think is 1,</span>
<span style="color: #989898;">;; </span><span style="color: #989898;">in order to get 2.</span>
(<span style="color: #b6a0ff;">lambda</span> (f)
  (<span style="color: #b6a0ff;">lambda</span> (x)
    (f
     (((<span style="color: #b6a0ff;">lambda</span> (f)
         (<span style="color: #b6a0ff;">lambda</span> (x)
           (f x))) f)
      x))))
<span style="color: #989898;">;; </span><span style="color: #989898;">=&gt;</span>
(<span style="color: #b6a0ff;">lambda</span> (f)
  (<span style="color: #b6a0ff;">lambda</span> (x)
    (f
     ((<span style="color: #b6a0ff;">lambda</span> (x) (f x)) x))))
<span style="color: #989898;">;; </span><span style="color: #989898;">=&gt;</span>
(<span style="color: #b6a0ff;">lambda</span> (f)
  (<span style="color: #b6a0ff;">lambda</span> (x)
    (f (f x))))
<span style="color: #989898;">;; </span><span style="color: #989898;">This one above should be 2.</span>
<span style="color: #989898;">;; </span><span style="color: #989898;">So:</span>
(<span style="color: #b6a0ff;">define</span> <span style="color: #feacd0;">two</span>
  (<span style="color: #b6a0ff;">lambda</span> (f)
    (<span style="color: #b6a0ff;">lambda</span> (x)
      (f (f x)))))
</pre>
</div>

<p>
So, we can think of Church's 0 is a ``two-lambda wall'' behind which
there is the value passed to the second lambda. Any other Church
numeral is a two-lambda wall behind which there is the application of
the value (which is supposed to be a procedure) passed to the first
lambda to the value passed to the second lambda.
</p>

<p>
How to add two Church numberals? We can ``wrap'' one number into the
other.
</p>

<p>
If we pass f to a Church number we get a lambda that takes x and
returns either x, some number n &gt;= 1 of nested applications of f,
whose innermost application is <code>(f x)</code>. For example, If we pass f to
the number 2 we get:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b6a0ff;">lambda</span> (x)
  (f (f x)))
</pre>
</div>
<p>
Now suppose, we want to add 2 to, say 1. What we want is to produce a
Church numera which is the expression above, wrapped into a lambda
that takes f and where x is replaced by the value behind the double
wall of 1. To ``unwrap'' a value we can pass f and then x, as already
shwon in <code>add-1</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b6a0ff;">define</span> <span style="color: #feacd0;">add</span> (<span style="color: #b6a0ff;">lambda</span> (n1)
              (<span style="color: #b6a0ff;">lambda</span> (n2)
                (<span style="color: #b6a0ff;">lambda</span> (f)
                  (<span style="color: #b6a0ff;">lambda</span> (x)
                    ((n2 f) ((n1 f) x)))))))

<span style="color: #989898;">;; </span><span style="color: #989898;">Or, the same thing:</span>
(<span style="color: #b6a0ff;">define</span> (<span style="color: #feacd0;">add</span> n1 n2)
  (<span style="color: #b6a0ff;">lambda</span> (f)
    (<span style="color: #b6a0ff;">lambda</span> (x)
      ((n2 f) ((n1 f) x)))))
</pre>
</div>


<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #989898;">;; </span><span style="color: #989898;">Lets try add 1 and 1</span>
<span style="color: #989898;">;; </span><span style="color: #989898;">1 is (lambda (f) (lambda (x) (f x)))</span>

(<span style="color: #b6a0ff;">lambda</span> (f)
  (<span style="color: #b6a0ff;">lambda</span> (x)
    (((<span style="color: #b6a0ff;">lambda</span> (f) (<span style="color: #b6a0ff;">lambda</span> (x) (f x))) f) (((<span style="color: #b6a0ff;">lambda</span> (f) (<span style="color: #b6a0ff;">lambda</span> (x) (f x))) f) x))))

(<span style="color: #b6a0ff;">lambda</span> (f)
  (<span style="color: #b6a0ff;">lambda</span> (x)
    ((<span style="color: #b6a0ff;">lambda</span> (x) (f x)) (((<span style="color: #b6a0ff;">lambda</span> (f) (<span style="color: #b6a0ff;">lambda</span> (x) (f x))) f) x))))

(<span style="color: #b6a0ff;">lambda</span> (f)
  (<span style="color: #b6a0ff;">lambda</span> (x)
    ((<span style="color: #b6a0ff;">lambda</span> (x) (f x)) ((<span style="color: #b6a0ff;">lambda</span> (x) (f x)) x))))

(<span style="color: #b6a0ff;">lambda</span> (f)
  (<span style="color: #b6a0ff;">lambda</span> (x)
    ((<span style="color: #b6a0ff;">lambda</span> (x) (f x)) (f x))))

(<span style="color: #b6a0ff;">lambda</span> (f)
  (<span style="color: #b6a0ff;">lambda</span> (x)
    ((<span style="color: #b6a0ff;">lambda</span> (x) (f x)) (f x))))

(<span style="color: #b6a0ff;">lambda</span> (f)
  (<span style="color: #b6a0ff;">lambda</span> (x)
    ((f (f x)))))

<span style="color: #989898;">;; </span><span style="color: #989898;">Lets try add 1 and 2</span>
<span style="color: #989898;">;; </span><span style="color: #989898;">1 is (lambda (f) (lambda (x) (f x)))</span>
<span style="color: #989898;">;; </span><span style="color: #989898;">2 is (lambda (f) (lambda (x) (f (f x))))</span>

(<span style="color: #b6a0ff;">lambda</span> (f)
  (<span style="color: #b6a0ff;">lambda</span> (x)
    (((<span style="color: #b6a0ff;">lambda</span> (f) (<span style="color: #b6a0ff;">lambda</span> (x) (f x))) f) (((<span style="color: #b6a0ff;">lambda</span> (f) (<span style="color: #b6a0ff;">lambda</span> (x) (f (f x)))) f) x))))

<span style="color: #989898;">;; </span><span style="color: #989898;">it seems to work...</span>

(<span style="color: #b6a0ff;">lambda</span> (f)
  (<span style="color: #b6a0ff;">lambda</span> (x)
    ((f (f (f x))))))
</pre>
</div>

<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Please, send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> if you have any comment.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</span></p>
</div>
</body>
</html>
